---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregate.GetEnumerator
source: html/5d9c1584-347b-4f6d-9089-905edaa7bf09.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<IFCData> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.